[{"name": "Shani Tran", "pic": "https://cdn0.sussexdirectories.com/rms/rms_photos/sized/17/59/325917-1570496-3_320x400.jpg?pu=1564753845", "description": "Wherever you are, right now in your life, my goal is to meet you right there. Choosing to come to therapy is a brave step and the first step in your personal healing journey. I listen with open ears, an open heart, and I'm slow to speak. It is important that you have the opportunity to be heard and tell your story. Therapy is a partnership and I am your partner. I focus on validation and empowerment, through a non-jugdemental approach. In addition I use motivational speaking to inspire you to take charge and own your story. ", "phonenum": "(612) 324-1838", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/325917?ref=1&tr=ResultsProfileBtn", "latitude": "44.9651014", "longitude": "-93.35507919999999", "sliding_scale": "No"}, 

{"name": "Jacqueline Pena'", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "You deserve to live the life that you want, however, this may difficult sometimes. Feelings of depression, anxiety and PTSD may be the result of past trauma, hurt and other unforeseen circumstances. Because of those experiences, the thought of seeking assistance (therapy) scary and overwhelming. I know exactly how you might be feeling, the fear of being judged, shamed or misunderstood can be frightening.  ", "phonenum": "(612) 999-2149", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/708390?ref=3&tr=ResultsProfileBtn", "latitude": "44.9123245", "longitude": "-93.32799209999999", "sliding_scale": "Yes"}, 
    
{"name": "Danielle Stewart", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "What would it be like to have an actual self-care plan and take an active approach to increasing moments of peace and happiness in your life? How many more opportunities would you grab if you weren't overthinking things? Are you wanting to speak up and get your needs met, but just aren’t sure how? If any of this sounds like a source of frustration for you therapy would be an excellent investment. I offer a safe and quiet space for you to explore your true self and implement strategies for more balance in your life. Currently offering individual therapy, maternal mental health therapy (perinatal), and clinical supervision.", "phonenum": "(667) 220-6760", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/800259?ref=4&tr=ResultsProfileBtn", "latitude": "44.9399136", "longitude": "-93.3642022", "sliding_scale": "Yes"}, 

{"name": "Nakami Green", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "Would you like to optimize your strengths in life? Do you need help finding balance? It can be helpful to partner with a professional who is able to identify areas of growth and help you better discover your strengths. Have you felt disempowered in life? This is a place to reclaim your identity. ", "phonenum": "(844) 967-0795", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/372758?ref=5&tr=ResultsProfileBtn", "latitude": "44.9506046", "longitude": "-93.08885339999999", "sliding_scale": "Yes"}, 

{"name": "Brockman Schumacher Jr", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "For more than 30 years I have counseled men, women, and teens addressing a crisis, a tragedy, something troubling they are struggling with now or from the past. My work with you will focus on developing your own skills to address current and past issues.  Your work with me will be empowering and deliberate and will enable you to have a more fulfilling future.  Our work together will include, but not necessarily be limited to consideration and assessments of how particular issues are affecting you and/or those you care about.  You may bring a partner, friend, or family member to our sessions.", "phonenum": "(612) 255-9519", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/59697?ref=14&tr=ResultsProfileBtn", "latitude": "44.909701", "longitude": "-93.286864", "sliding_scale": "Yes"}, 

{"name": "Albert N Brown", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "I have 20 years' combined experience working with culturally, ethnically and generationally diverse clients in therapy, chemical use, restorative justice, and counseling children and families in need.  I'm dedicated to enthusiastic, respectful and dynamic interactions as a means of creating and nurturing community interest. As a psychotherapist and LADC, I've worked with adults, adolescents, and families from all walks of life. My goal is to foster well-being in individuals and families. I seek to eliminate the stigma of shame and guilt associated with mental health and substance use, which leads to understanding, respectful conversations that enable healing.", "phonenum": "(612) 979-2511 x2", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/323696?ref=15&tr=ResultsProfileBtn", "latitude": "45.0307918", "longitude": "-93.288341", "sliding_scale": "Yes"}, 

{"name": "Levan Counseling & Consulting", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "My passion is helping individuals, couples and families live the lives they deserve. I am a straightforward, innovative therapist with an outstanding track record for helping my clients live healthy productive lives. My personal commitment to you as your therapist is to provide counseling and psychoeducation using Cognitive Behavior Therapy to promote healthy thinking and positive outcomes. I am a firm believer that in order to change behavior we have to gain insight into underlying beliefs that have developed over time through experiences.", "phonenum": "(612) 254-0195", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/65732?ref=19&tr=ResultsProfileBtn", "latitude": "45.0770329", "longitude": "-93.317475", "sliding_scale": "Yes"}, 

{"name": "Alexandria Grim", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "My name is Alexandria Grim or Lexy for short. I am a licensed professional counselor and owner of Breaking Free Counseling and Consulting Services. I have a B.A. in African American Studies and a minor in Sociology from the University of Mn.  I also have a M.S. in Clinical Mental Health Counseling with a specialization in Forensic Counseling from Walden University.  My counseling style is hinged upon eclecticism. Specifically ,my approach blends a balance between intuition and a spiritual lens with influences of Adlerian therapy, DBT, CBT, TF-CBT, EFT, Feminism and Afrocentrism.", "phonenum": "(612) 260-7252", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/353999?ref=20&tr=ResultsProfileBtn", "latitude": "45.0770329", "longitude": "-93.317475", "sliding_scale": "Yes"}]