[{"name": "Shani Tran", "pic": "https://cdn0.sussexdirectories.com/rms/rms_photos/sized/17/59/325917-1570496-3_320x400.jpg?pu=1564753845", "description": "Wherever you are, right now in your life, my goal is to meet you right there. Choosing to come to therapy is a brave step and the first step in your personal healing journey. I listen with open ears, an open heart, and I'm slow to speak. It is important that you have the opportunity to be heard and tell your story. Therapy is a partnership and I am your partner. I focus on validation and empowerment, through a non-jugdemental approach. In addition I use motivational speaking to inspire you to take charge and own your story. ", "phonenum": "(612) 324-1838", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/325917?ref=1&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Acacia Counseling and Wellness, Minneapolis", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "Acacia Counseling and Wellness is a leading provider of outpatient, university mental health support. We provide individual, couples, and group therapy, as well as psychiatry and medication management. We specialize in providing high-quality mental health services to university students, faculty, and staff, as well as the greater community. Our office is conveniently located near UMN, and our therapists are trained across a variety of issues and modalities. We are committed to providing a safe, supportive environment and a positive therapeutic experience. ", "phonenum": "(805) 706-8228", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/216651?ref=2&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Jacqueline Pena'", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "You deserve to live the life that you want, however, this may difficult sometimes. Feelings of depression, anxiety and PTSD may be the result of past trauma, hurt and other unforeseen circumstances. Because of those experiences, the thought of seeking assistance (therapy) scary and overwhelming. I know exactly how you might be feeling, the fear of being judged, shamed or misunderstood can be frightening.  ", "phonenum": "(612) 999-2149", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/708390?ref=3&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Danielle Stewart", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "What would it be like to have an actual self-care plan and take an active approach to increasing moments of peace and happiness in your life? How many more opportunities would you grab if you weren't overthinking things? Are you wanting to speak up and get your needs met, but just aren’t sure how? If any of this sounds like a source of frustration for you therapy would be an excellent investment. I offer a safe and quiet space for you to explore your true self and implement strategies for more balance in your life. Currently offering individual therapy, maternal mental health therapy (perinatal), and clinical supervision.", "phonenum": "(667) 220-6760", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/800259?ref=4&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Nakami Green", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "Would you like to optimize your strengths in life? Do you need help finding balance? It can be helpful to partner with a professional who is able to identify areas of growth and help you better discover your strengths. Have you felt disempowered in life? This is a place to reclaim your identity. ", "phonenum": "(844) 967-0795", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/372758?ref=5&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Chelsea Wagner Psychotherapy", "pic": "https://cdn4.sussexdirectories.com/rms/rms_photos/sized/41/83/328341-1884758-3_320x400.jpg?pu=1593713263", "description": "Most people are full of ambition, drive, and desire but find themselves repeating old “unworked” patterns that impact them both personally and professionally. Together, we’ll explore and identify these patterns, make meaning of your past, and allow the most authentic version of yourself to emerge. My goal is to help you cultivate a sense of curiosity about yourself. Therapy will be a place for you to arrive at your own conclusions, get unstuck, and evolve. ", "phonenum": "(763) 225-2669", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/328341?ref=6&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Christina Gwenn Copeland", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "Christina enjoys working with individuals, couples and families helping support them in making changes they want to make. She has her B.A. in Sociology and Diversity Studies from SCSU and her M.S. in MHC from Walden University. She is in pursuit of her Licensed Professional Clinical Counselor credential. Christina has 30 years of experience providing adults, adolescents, children, and families with services that are person-centered, strength-based and therapeutic. She has worked in foster care and long-term residential, community based programs, as well as crisis and substance abuse/recovery treatment, vocational and education areas", "phonenum": "(636) 266-2065", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/259369?ref=7&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Jan Search", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "Working together toward change, I place importance of the relationship with you in the therapy and emphasize getting to know you as an individual.  We work toward your goals by exploring, not just your behavior, but the underlying feelings and thoughts which get in the way of your ability to make the changes you desire.  ", "phonenum": "(651) 760-8037", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/61911?ref=8&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Irene Greene", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "Welcome. It is your time to re-energize, let go of whatever is holding you back, expand your self-awareness and maximize your strengths. I will combine my compassion, openness and attentiveness with my 28+ years of experience and knowledge and help you to become more of the person who you want to be. Address abuse, codependency, self-criticism, anxiety, imposter syndrome. Improve mindfulness, self-work-life-relationship balance. I offer a space where privilege, oppression and injustice are understood as having a direct correlation to our health and wellbeing; A relaxed confidential space where you are welcome to be your whole self. ", "phonenum": "(612) 808-0124", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/237266?ref=9&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Stephanie C", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": " Considering therapy is a courageous step. If you are struggling therapy can help. Together we can find a new approach and a different lens to see your experiences through. I can help you understand your thoughts, redefine your emotions and create meaning in your life. Evening and weekend appointments offered. ", "phonenum": "(612) 250-5936", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/408751?ref=10&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Amanda Moua", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "Amanda believes that every individual has the ability and strength within themselves to work through the different life stresses that impact their daily functioning. She seeks to build a safe and respectful relationship with clients to help them explore and process the difficulties and adversities they are experiencing. Amanda works with children and adults of all ages, primarily in individual and family therapy. She enjoys working with children who are experiencing social, emotional and behavioral problems in school, home and environment.", "phonenum": "(612) 324-7353", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/395946?ref=11&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Carrie Miller", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "There is hope after trauma.                     MEND Therapy is unique in the twin cities in that we are an in-house, all-inclusive  collaboration of trauma-informed body workers and psychotherapists. The research is clear:  trauma lives in the body, not just the mind.  We utilize the cutting edge, most effective and always  research-based methods for treating trauma.  Because trauma is not just in your head and talk therapy isn't enough.", "phonenum": "(651) 409-9125", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/345133?ref=12&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Stone Arch Psychology and Health Services", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "Welcome to Stone Arch Psychology and Health Services. Our motto, Opening Doors and Building Bridges, is a statement of our commitment to help you make positive life changes. Please visit our website to learn more about our clinic, clinicians, and services at STONEARCHPSYCH.COM", "phonenum": "(612) 979-2477", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/366142?ref=13&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Brockman Schumacher Jr", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "For more than 30 years I have counseled men, women, and teens addressing a crisis, a tragedy, something troubling they are struggling with now or from the past. My work with you will focus on developing your own skills to address current and past issues.  Your work with me will be empowering and deliberate and will enable you to have a more fulfilling future.  Our work together will include, but not necessarily be limited to consideration and assessments of how particular issues are affecting you and/or those you care about.  You may bring a partner, friend, or family member to our sessions.", "phonenum": "(612) 255-9519", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/59697?ref=14&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Albert N Brown", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "I have 20 years' combined experience working with culturally, ethnically and generationally diverse clients in therapy, chemical use, restorative justice, and counseling children and families in need.  I'm dedicated to enthusiastic, respectful and dynamic interactions as a means of creating and nurturing community interest. As a psychotherapist and LADC, I've worked with adults, adolescents, and families from all walks of life. My goal is to foster well-being in individuals and families. I seek to eliminate the stigma of shame and guilt associated with mental health and substance use, which leads to understanding, respectful conversations that enable healing.", "phonenum": "(612) 979-2511 x2", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/323696?ref=15&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Theresa J Crawford", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "If you're feeling alone in whatever you're struggling with, I'm here to help. I have compassion and vast life experience to help support and guide you through this. I provide a safe and accepting space, where your creative, intuitive self can find answers. Together, things won't seem so hard. Telehealth option is now available! In response to COVID-19, I am offering my regular services via telehealth. I will continue seeing clients in my office for regular in-person sessions, but if you need or want to meet virtually with me via telehealth instead, that is currently an option. Call or email me for more information. ", "phonenum": "(612) 223-7495", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/87397?ref=16&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Nicole M Billingsley", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "I am a Licensed Alcohol and Drug Counselor and a Psychotherapist Practitioner, under supervision while completing my final year of my Master's of Social Work. I work from a strengths-based, client-centered approach and I am committed to creating change and hope in my clients' lives. My belief is that we all possess the strengths necessary to overcome adversities and it is my goal to help the client discover and utilize those strengths. I have experience working with adolescents and adults.", "phonenum": "(469) 694-2366", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/357735?ref=17&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Tayler Marie L'amoureux", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "I am a Licensed Independent Clinical Social Worker providing psychotherapy to children and adults in the Minneapolis area. I started practicing psychotherapy at Mayo Clinic in Rochester, MN. During my time there, I was trained in helping both children and adults build coping skills to be able to help themselves through life's many unique challenges. Currently, I am training at the Institute for Clinical Social Work in Chicago where I will earn a PhD with a specialty in Psychodynamic therapy. This therapy helps clients process and create meaning from past life events, as well as helps people live life to its fullest moving forward. ", "phonenum": "(612) 688-9806", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/755878?ref=18&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Levan Counseling & Consulting", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "My passion is helping individuals, couples and families live the lives they deserve. I am a straightforward, innovative therapist with an outstanding track record for helping my clients live healthy productive lives. My personal commitment to you as your therapist is to provide counseling and psychoeducation using Cognitive Behavior Therapy to promote healthy thinking and positive outcomes. I am a firm believer that in order to change behavior we have to gain insight into underlying beliefs that have developed over time through experiences.", "phonenum": "(612) 254-0195", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/65732?ref=19&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}, {"name": "Alexandria Grim", "pic": "https://resources.psychologytoday.com/v5.992.0/images/profilePlaceholder.png", "description": "My name is Alexandria Grim or Lexy for short. I am a licensed professional counselor and owner of Breaking Free Counseling and Consulting Services. I have a B.A. in African American Studies and a minor in Sociology from the University of Mn.  I also have a M.S. in Clinical Mental Health Counseling with a specialization in Forensic Counseling from Walden University.  My counseling style is hinged upon eclecticism. Specifically ,my approach blends a balance between intuition and a spiritual lens with influences of Adlerian therapy, DBT, CBT, TF-CBT, EFT, Feminism and Afrocentrism.", "phonenum": "(612) 260-7252", "fp": "https://www.psychologytoday.com/us/therapists/african-american/mn/minneapolis/353999?ref=20&tr=ResultsProfileBtn", "latitude": "x", "longitude": "x", "sliding_scale": "x"}]